import { GridColDef } from "@mui/x-data-grid";

export const columns: GridColDef[] = [
    {
        field: 'title',
        headerName: 'Назва',
        width: 350,
        headerClassName: 'super-app-theme--header',
    }
];

export const topicsArray = [
    {
        id: 19,
        title: 'Числові множини',
    }, {
        id: 20,
        title: 'Подільність',
    }, {
        id: 21,
        title: 'Задачі на рух, відсотки...',
    }, {
        id: 29,
        title: 'Дробово-раціональні рівняння',
    }, {
        id: 53,
        title: 'Планіметрія',
    }, {
        id: 36,
        title: 'Квадратні нерівності',
    }, {
        id: 43,
        title: 'Тригонометрія.Формули',
    }, {
        id: 23,
        title: 'Дробові вирази',
    }, {
        id: 24,
        title: 'Степінь',
    }, {
        id: 25,
        title: 'Арифметичний корінь',
    }, {
        id: 26,
        title: 'Логарифм',
    }, {
        id: 27,
        title: 'Лінійні рівняння',
    }, {
        id: 28,
        title: 'Квадратні рівняння',
    }, {
        id: 30,
        title: 'Рівняння з модулем',
    }, {
        id: 31,
        title: 'Ірраціональні рівняння',
    }, {
        id: 32,
        title: 'Показникові рівняння',
    }, {
        id: 33,
        title: 'Логарифмічні рівняння',
    }, {
        id: 34,
        title: 'Системи рівнянь',
    }, {
        id: 37,
        title: 'Метод інтервалів',
    }, {
        id: 38,
        title: 'Нерівності з модулем',
    }, {
        id: 39,
        title: 'Ірраціональні нерівності',
    }, {
        id: 40,
        title: 'Показникові нерівності',
    }, {
        id: 41,
        title: 'Логарифмічні нерівності',
    }, {
        id: 42,
        title: 'Тригонометрія',
    }, {
        id: 35,
        title: 'Лінійні нерівності',
    }, {
        id: 45,
        title: 'Тригонометричні рівняння',
    }, {
        id: 46,
        title: 'Тригонометричні нерівності',
    }, {
        id: 47,
        title: 'Функції, графіки',
    }, {
        id: 48,
        title: 'Прогресія',
    }, {
        id: 49,
        title: 'Похідна',
    }, {
        id: 50,
        title: 'Первісна',
    }, {
        id: 51,
        title: 'Комбінаторика',
    }, {
        id: 52,
        title: 'Ймовірність',
    }, {
        id: 44,
        title: 'Обернені тригонометричні функції',
    }, {
        id: 59,
        title: 'Статистика',
    }, {
        id: 22,
        title: 'Раціональні числа, розкладання на множники',
    }, {
        id: 54,
        title: 'Стереометрія',
    }, {
        id: 55,
        title: 'Вектори, Координати',
    }, {
        id: 56,
        title: 'Різне',
    }, {
        id: 57,
        title: 'Задачі з параметром',
    }, {
        id: 58,
        title: 'Модуль',
    },
]

